-- MySQL dump 10.13  Distrib 8.0.46, for Win64 (x86_64)
--
-- Host: localhost    Database: clinic_db
-- ------------------------------------------------------
-- Server version	8.0.46

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `beds`
--

DROP TABLE IF EXISTS `beds`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `beds` (
  `id` int NOT NULL AUTO_INCREMENT,
  `room_number` varchar(10) NOT NULL,
  `bed_number` varchar(5) NOT NULL,
  `patient_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `patient_id` (`patient_id`),
  CONSTRAINT `beds_ibfk_1` FOREIGN KEY (`patient_id`) REFERENCES `patients` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=63 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `beds`
--

LOCK TABLES `beds` WRITE;
/*!40000 ALTER TABLE `beds` DISABLE KEYS */;
INSERT INTO `beds` VALUES (1,'101','А',NULL),(2,'101','Б',NULL),(3,'101','В',97),(4,'101','Г',NULL),(5,'102','А',NULL),(6,'102','Б',NULL),(7,'102','В',NULL),(8,'102','Г',NULL),(9,'103','А',NULL),(10,'103','Б',NULL),(11,'103','В',NULL),(12,'103','Г',NULL),(13,'103','Д',NULL),(14,'104','А',NULL),(15,'104','Б',NULL),(16,'104','В',NULL),(17,'104','Г',NULL),(18,'105','А',NULL),(19,'105','Б',NULL),(20,'105','В',NULL),(21,'105','Г',NULL),(22,'106','А',NULL),(23,'106','Б',NULL),(24,'106','В',NULL),(25,'106','Г',NULL),(26,'107','А',NULL),(27,'107','Б',NULL),(28,'107','В',NULL),(29,'107','Г',NULL),(30,'108','А',NULL),(31,'108','Б',NULL),(32,'108','В',NULL),(33,'109','А',NULL),(34,'109','Б',NULL),(35,'109','В',NULL),(36,'110','А',NULL),(37,'110','Б',NULL),(38,'110','В',NULL),(39,'111','А',NULL),(40,'111','Б',NULL),(41,'111','В',NULL),(42,'111','Г',NULL),(43,'112','А',NULL),(44,'112','Б',NULL),(45,'112','В',NULL),(46,'112','Г',NULL),(47,'113','А',NULL),(48,'113','Б',NULL),(49,'113','В',NULL),(50,'113','Г',NULL),(51,'114','А',NULL),(52,'114','Б',NULL),(53,'115','А',NULL),(54,'115','Б',NULL),(55,'115','В',NULL),(56,'115','Г',NULL),(57,'116','А',NULL),(58,'116','Б',NULL),(59,'117','А',NULL),(60,'117','Б',NULL),(61,'118','А',NULL),(62,'118','Б',NULL);
/*!40000 ALTER TABLE `beds` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doctors`
--

DROP TABLE IF EXISTS `doctors`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `doctors` (
  `id` int NOT NULL AUTO_INCREMENT,
  `last_name` varchar(100) NOT NULL,
  `first_name` varchar(100) NOT NULL,
  `middle_name` varchar(100) DEFAULT NULL,
  `specialization` varchar(100) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doctors`
--

LOCK TABLES `doctors` WRITE;
/*!40000 ALTER TABLE `doctors` DISABLE KEYS */;
INSERT INTO `doctors` VALUES (1,'Смирнов','Алексей','Петрович','Терапевт','+7-900-111-11-11'),(2,'Кузнецова','Ольга','Ивановна','Кардиолог','+7-900-222-22-22'),(3,'Попов','Дмитрий','Сергеевич','Хирург','+7-900-333-33-33'),(4,'Лебедева','Анна','Николаевна','Невролог','+7-900-444-44-44'),(5,'Соколов','Игорь','Андреевич','Окулист','+7-900-555-55-55');
/*!40000 ALTER TABLE `doctors` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hospitalizations`
--

DROP TABLE IF EXISTS `hospitalizations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hospitalizations` (
  `id` int NOT NULL AUTO_INCREMENT,
  `patient_id` int NOT NULL,
  `hospitalization_code` varchar(50) DEFAULT NULL,
  `department` varchar(100) DEFAULT NULL,
  `purpose` varchar(255) DEFAULT NULL,
  `admission_date` datetime DEFAULT NULL,
  `discharge_date` datetime DEFAULT NULL,
  `conditions` varchar(50) DEFAULT NULL,
  `status` varchar(50) DEFAULT 'Запланирована',
  PRIMARY KEY (`id`),
  KEY `hospitalizations_ibfk_1` (`patient_id`),
  CONSTRAINT `hospitalizations_ibfk_1` FOREIGN KEY (`patient_id`) REFERENCES `patients` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=103 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hospitalizations`
--

LOCK TABLES `hospitalizations` WRITE;
/*!40000 ALTER TABLE `hospitalizations` DISABLE KEYS */;
INSERT INTO `hospitalizations` VALUES (1,1,'HOSP-00001','Кардиология','Операция','2026-09-12 11:40:18','2026-10-02 11:40:18','Бюджет','Активна'),(2,2,'HOSP-00002','Неврология','Лечение','2026-09-22 11:40:18','2026-10-06 11:40:18','Платно','Завершена'),(3,3,'HOSP-00003','Кардиология','Обследование','2026-09-04 11:40:18','2026-10-03 11:40:18','Платно','Запланирована'),(4,4,'HOSP-00004','Неврология','Операция','2026-09-04 11:40:18','2026-10-07 11:40:18','Платно','Запланирована'),(5,5,'HOSP-00005','Неврология','Обследование','2026-09-15 11:40:18','2026-10-05 11:40:18','Платно','Завершена'),(6,6,'HOSP-00006','Терапия','Реабилитация','2026-09-23 11:40:18','2026-09-30 11:40:18','Бюджет','Запланирована'),(7,7,'HOSP-00007','Терапия','Лечение','2026-09-19 11:40:18','2026-10-03 11:40:18','Бюджет','Активна'),(8,8,'HOSP-00008','Хирургия','Операция','2026-09-14 11:40:18','2026-09-29 11:40:18','Платно','Активна'),(9,9,'HOSP-00009','Кардиология','Обследование','2026-09-18 11:40:18','2026-10-03 11:40:18','Бюджет','Активна'),(10,10,'HOSP-00010','Терапия','Операция','2026-09-18 11:40:18','2026-09-28 11:40:18','Платно','Активна'),(11,11,'HOSP-00011','Хирургия','Лечение','2026-09-14 11:40:18','2026-09-30 11:40:18','Бюджет','Завершена'),(12,12,'HOSP-00012','Хирургия','Лечение','2026-08-31 11:40:18','2026-10-03 11:40:18','Бюджет','Активна'),(13,13,'HOSP-00013','Хирургия','Операция','2026-09-10 11:40:18','2026-10-06 11:40:18','Платно','Завершена'),(14,14,'HOSP-00014','Хирургия','Обследование','2026-08-30 11:40:18','2026-09-30 11:40:18','Платно','Активна'),(15,15,'HOSP-00015','Кардиология','Лечение','2026-09-16 11:40:18','2026-10-03 11:40:18','Бюджет','Завершена'),(16,16,'HOSP-00016','Хирургия','Операция','2026-09-10 11:40:18','2026-09-28 11:40:18','Платно','Запланирована'),(17,17,'HOSP-00017','Терапия','Обследование','2026-09-17 11:40:18','2026-10-02 11:40:18','Платно','Активна'),(18,18,'HOSP-00018','Хирургия','Операция','2026-09-26 11:40:18','2026-10-04 11:40:18','Платно','Запланирована'),(19,19,'HOSP-00019','Кардиология','Лечение','2026-09-25 11:40:18','2026-09-29 11:40:18','Платно','Завершена'),(20,20,'HOSP-00020','Неврология','Реабилитация','2026-09-19 11:40:18','2026-09-29 11:40:18','Бюджет','Запланирована'),(21,21,'HOSP-00021','Хирургия','Операция','2026-09-22 11:40:18','2026-09-29 11:40:18','Платно','Активна'),(22,22,'HOSP-00022','Хирургия','Реабилитация','2026-08-31 11:40:18','2026-09-30 11:40:18','Платно','Завершена'),(23,23,'HOSP-00023','Неврология','Лечение','2026-09-09 11:40:18','2026-10-06 11:40:18','Платно','Запланирована'),(24,24,'HOSP-00024','Хирургия','Лечение','2026-09-15 11:40:18','2026-10-02 11:40:18','Бюджет','Завершена'),(25,25,'HOSP-00025','Неврология','Реабилитация','2026-09-20 11:40:18','2026-09-28 11:40:18','Платно','Запланирована'),(26,26,'HOSP-00026','Терапия','Обследование','2026-09-27 11:40:18','2026-09-28 11:40:18','Бюджет','Активна'),(27,27,'HOSP-00027','Хирургия','Лечение','2026-08-30 11:40:18','2026-09-28 11:40:18','Бюджет','Активна'),(28,28,'HOSP-00028','Хирургия','Обследование','2026-09-11 11:40:18','2026-10-01 11:40:18','Бюджет','Завершена'),(29,29,'HOSP-00029','Хирургия','Операция','2026-09-19 11:40:18','2026-10-06 11:40:18','Платно','Запланирована'),(30,30,'HOSP-00030','Неврология','Реабилитация','2026-09-12 11:40:18','2026-09-30 11:40:18','Платно','Активна'),(31,31,'HOSP-00031','Терапия','Лечение','2026-09-19 11:40:18','2026-10-03 11:40:18','Бюджет','Запланирована'),(32,32,'HOSP-00032','Хирургия','Лечение','2026-09-19 11:40:18','2026-10-06 11:40:18','Платно','Запланирована'),(33,33,'HOSP-00033','Кардиология','Обследование','2026-09-11 11:40:18','2026-10-03 11:40:18','Бюджет','Активна'),(34,34,'HOSP-00034','Терапия','Операция','2026-09-22 11:40:18','2026-09-29 11:40:18','Платно','Завершена'),(35,35,'HOSP-00035','Кардиология','Реабилитация','2026-09-11 11:40:18','2026-10-01 11:40:18','Платно','Завершена'),(36,36,'HOSP-00036','Терапия','Реабилитация','2026-09-16 11:40:18','2026-10-04 11:40:18','Платно','Завершена'),(37,37,'HOSP-00037','Неврология','Операция','2026-09-04 11:40:18','2026-10-06 11:40:18','Бюджет','Завершена'),(38,38,'HOSP-00038','Неврология','Реабилитация','2026-09-15 11:40:18','2026-10-06 11:40:18','Платно','Завершена'),(39,39,'HOSP-00039','Хирургия','Операция','2026-09-04 11:40:18','2026-10-03 11:40:18','Платно','Запланирована'),(40,40,'HOSP-00040','Терапия','Реабилитация','2026-09-03 11:40:18','2026-10-05 11:40:18','Платно','Активна'),(41,41,'HOSP-00041','Хирургия','Реабилитация','2026-09-24 11:40:18','2026-09-29 11:40:18','Платно','Активна'),(42,42,'HOSP-00042','Терапия','Операция','2026-09-09 11:40:18','2026-09-29 11:40:18','Бюджет','Запланирована'),(43,43,'HOSP-00043','Неврология','Реабилитация','2026-09-14 11:40:18','2026-10-06 11:40:18','Бюджет','Запланирована'),(44,44,'HOSP-00044','Терапия','Обследование','2026-09-22 11:40:18','2026-10-06 11:40:18','Бюджет','Запланирована'),(45,45,'HOSP-00045','Кардиология','Лечение','2026-09-14 11:40:18','2026-10-07 11:40:18','Платно','Активна'),(46,46,'HOSP-00046','Неврология','Операция','2026-09-18 11:40:18','2026-09-29 11:40:18','Платно','Запланирована'),(47,47,'HOSP-00047','Хирургия','Обследование','2026-09-19 11:40:18','2026-10-02 11:40:18','Платно','Запланирована'),(48,48,'HOSP-00048','Хирургия','Операция','2026-09-08 11:40:18','2026-09-30 11:40:18','Платно','Активна'),(49,49,'HOSP-00049','Кардиология','Обследование','2026-09-15 11:40:18','2026-10-04 11:40:18','Бюджет','Завершена'),(50,50,'HOSP-00050','Хирургия','Обследование','2026-09-24 11:40:18','2026-10-05 11:40:18','Платно','Активна'),(51,51,'HOSP-00051','Неврология','Обследование','2026-09-25 11:40:18','2026-09-30 11:40:18','Бюджет','Завершена'),(52,52,'HOSP-00052','Терапия','Операция','2026-09-18 11:40:18','2026-09-28 11:40:18','Платно','Запланирована'),(53,53,'HOSP-00053','Терапия','Лечение','2026-09-19 11:40:18','2026-10-04 11:40:18','Платно','Завершена'),(54,54,'HOSP-00054','Кардиология','Обследование','2026-08-30 11:40:18','2026-10-01 11:40:18','Бюджет','Активна'),(55,55,'HOSP-00055','Терапия','Обследование','2026-09-28 11:40:18','2026-10-06 11:40:18','Платно','Завершена'),(56,56,'HOSP-00056','Терапия','Операция','2026-09-06 11:40:18','2026-10-05 11:40:18','Бюджет','Запланирована'),(57,57,'HOSP-00057','Неврология','Реабилитация','2026-09-25 11:40:18','2026-10-04 11:40:18','Бюджет','Завершена'),(58,58,'HOSP-00058','Кардиология','Реабилитация','2026-09-15 11:40:18','2026-10-05 11:40:18','Платно','Завершена'),(59,59,'HOSP-00059','Неврология','Лечение','2026-09-11 11:40:18','2026-10-06 11:40:18','Платно','Запланирована'),(60,60,'HOSP-00060','Терапия','Реабилитация','2026-09-02 11:40:18','2026-10-06 11:40:18','Платно','Запланирована'),(61,61,'HOSP-00061','Хирургия','Лечение','2026-09-28 11:40:18','2026-10-03 11:40:18','Бюджет','Запланирована'),(62,62,'HOSP-00062','Кардиология','Обследование','2026-09-01 11:40:18','2026-10-03 11:40:18','Бюджет','Запланирована'),(63,63,'HOSP-00063','Хирургия','Лечение','2026-09-14 11:40:18','2026-10-07 11:40:18','Платно','Активна'),(64,64,'HOSP-00064','Неврология','Операция','2026-09-08 11:40:18','2026-10-04 11:40:18','Платно','Активна'),(65,65,'HOSP-00065','Кардиология','Обследование','2026-09-05 11:40:18','2026-10-04 11:40:18','Бюджет','Завершена'),(66,66,'HOSP-00066','Кардиология','Операция','2026-09-14 11:40:18','2026-10-05 11:40:18','Платно','Запланирована'),(67,67,'HOSP-00067','Терапия','Обследование','2026-09-21 11:40:18','2026-10-06 11:40:18','Бюджет','Запланирована'),(68,68,'HOSP-00068','Терапия','Операция','2026-09-13 11:40:18','2026-10-06 11:40:18','Платно','Завершена'),(69,69,'HOSP-00069','Хирургия','Обследование','2026-09-05 11:40:18','2026-09-30 11:40:18','Бюджет','Запланирована'),(70,70,'HOSP-00070','Хирургия','Обследование','2026-09-21 11:40:18','2026-10-02 11:40:18','Бюджет','Запланирована'),(71,71,'HOSP-00071','Терапия','Лечение','2026-09-04 11:40:18','2026-10-06 11:40:18','Бюджет','Активна'),(72,72,'HOSP-00072','Неврология','Лечение','2026-09-01 11:40:18','2026-09-29 11:40:18','Бюджет','Запланирована'),(73,73,'HOSP-00073','Терапия','Операция','2026-08-30 11:40:18','2026-10-01 11:40:18','Бюджет','Завершена'),(74,74,'HOSP-00074','Терапия','Реабилитация','2026-09-25 11:40:18','2026-10-07 11:40:18','Платно','Завершена'),(75,75,'HOSP-00075','Неврология','Обследование','2026-09-09 11:40:18','2026-09-29 11:40:18','Бюджет','Активна'),(76,76,'HOSP-00076','Хирургия','Лечение','2026-09-13 11:40:18','2026-10-02 11:40:18','Бюджет','Запланирована'),(77,77,'HOSP-00077','Кардиология','Обследование','2026-09-10 11:40:18','2026-10-05 11:40:18','Бюджет','Завершена'),(78,78,'HOSP-00078','Хирургия','Реабилитация','2026-09-15 11:40:18','2026-10-01 11:40:18','Бюджет','Завершена'),(79,79,'HOSP-00079','Кардиология','Лечение','2026-09-07 11:40:18','2026-10-02 11:40:18','Платно','Активна'),(80,80,'HOSP-00080','Неврология','Реабилитация','2026-09-08 11:40:18','2026-09-28 11:40:18','Бюджет','Завершена'),(81,81,'HOSP-00081','Терапия','Лечение','2026-09-12 11:40:18','2026-10-02 11:40:18','Бюджет','Активна'),(82,82,'HOSP-00082','Хирургия','Обследование','2026-09-19 11:40:18','2026-09-29 11:40:18','Платно','Активна'),(83,83,'HOSP-00083','Хирургия','Лечение','2026-09-20 11:40:18','2026-10-07 11:40:18','Бюджет','Запланирована'),(84,84,'HOSP-00084','Терапия','Операция','2026-09-06 11:40:18','2026-10-07 11:40:18','Платно','Запланирована'),(85,85,'HOSP-00085','Кардиология','Лечение','2026-09-08 11:40:18','2026-10-04 11:40:18','Платно','Активна'),(86,86,'HOSP-00086','Терапия','Лечение','2026-09-01 11:40:18','2026-09-28 11:40:18','Бюджет','Запланирована'),(87,87,'HOSP-00087','Кардиология','Операция','2026-09-18 11:40:18','2026-10-07 11:40:18','Платно','Активна'),(88,88,'HOSP-00088','Неврология','Реабилитация','2026-09-22 11:40:18','2026-10-01 11:40:18','Бюджет','Запланирована'),(89,89,'HOSP-00089','Кардиология','Реабилитация','2026-09-17 11:40:18','2026-10-07 11:40:18','Платно','Активна'),(90,90,'HOSP-00090','Терапия','Реабилитация','2026-09-01 11:40:18','2026-09-29 11:40:18','Платно','Активна'),(91,91,'HOSP-00091','Неврология','Операция','2026-09-18 11:40:18','2026-10-07 11:40:18','Бюджет','Запланирована'),(92,92,'HOSP-00092','Терапия','Реабилитация','2026-09-16 11:40:18','2026-10-01 11:40:18','Платно','Запланирована'),(93,93,'HOSP-00093','Неврология','Реабилитация','2026-09-27 11:40:18','2026-09-30 11:40:18','Платно','Активна'),(94,94,'HOSP-00094','Хирургия','Операция','2026-09-10 11:40:18','2026-10-06 11:40:18','Платно','Завершена'),(95,95,'HOSP-00095','Хирургия','Обследование','2026-09-03 11:40:18','2026-09-28 11:40:18','Бюджет','Завершена'),(96,96,'HOSP-00096','Кардиология','Обследование','2026-09-14 11:40:18','2026-10-06 11:40:18','Бюджет','Активна'),(97,97,'HOSP-00097','Терапия','Лечение','2026-09-19 11:40:18','2026-10-02 11:40:18','Платно','Активна'),(98,98,'HOSP-00098','Кардиология','Лечение','2026-08-30 11:40:18','2026-10-05 11:40:18','Бюджет','Отменена'),(99,99,'HOSP-00099','Хирургия','Обследование','2026-09-16 11:40:18','2026-10-03 11:40:18','Платно','Отменена'),(101,95,'HOSP-24249','Кардиология','Обследование','2026-09-29 00:00:00',NULL,'Платно','Отменена'),(102,99,'HOSP-16937','Кардиология','Лечение','2026-09-29 00:00:00',NULL,'Платно','Запланирована');
/*!40000 ALTER TABLE `hospitalizations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `medical_services`
--

DROP TABLE IF EXISTS `medical_services`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `medical_services` (
  `id` int NOT NULL AUTO_INCREMENT,
  `service_name` varchar(200) NOT NULL,
  `service_type` varchar(100) DEFAULT NULL,
  `price` decimal(10,2) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `medical_services`
--

LOCK TABLES `medical_services` WRITE;
/*!40000 ALTER TABLE `medical_services` DISABLE KEYS */;
INSERT INTO `medical_services` VALUES (1,'Общий анализ крови','Лабораторное исследование',450.00),(2,'Биохимический анализ крови','Лабораторное исследование',1200.00),(3,'Анализ мочи общий','Лабораторное исследование',350.00),(4,'Рентген грудной клетки','Инструментальная диагностика',800.00),(5,'МРТ головного мозга','Инструментальная диагностика',4500.00),(6,'КТ брюшной полости','Инструментальная диагностика',3800.00),(7,'УЗИ сердца','Инструментальная диагностика',1500.00),(8,'Физиотерапия (10 сеансов)','Физиотерапия',3000.00),(9,'Лекарственная терапия (курс)','Лекарственная терапия',5000.00),(10,'Консультация хирурга','Консультация',900.00);
/*!40000 ALTER TABLE `medical_services` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `patients`
--

DROP TABLE IF EXISTS `patients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `patients` (
  `id` int NOT NULL AUTO_INCREMENT,
  `first_name` varchar(100) NOT NULL,
  `last_name` varchar(100) NOT NULL,
  `middle_name` varchar(100) DEFAULT NULL,
  `passport_series` varchar(10) DEFAULT NULL,
  `passport_number` varchar(20) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `gender` varchar(10) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `workplace` varchar(150) DEFAULT NULL,
  `insurance_policy` varchar(30) DEFAULT NULL,
  `insurance_company` varchar(100) DEFAULT NULL,
  `policy_expiry` date DEFAULT NULL,
  `medical_card_number` varchar(50) DEFAULT NULL,
  `card_issue_date` date DEFAULT NULL,
  `photo_path` varchar(255) DEFAULT NULL,
  `diagnosis` varchar(255) DEFAULT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `medical_card_number` (`medical_card_number`)
) ENGINE=InnoDB AUTO_INCREMENT=102 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patients`
--

LOCK TABLES `patients` WRITE;
/*!40000 ALTER TABLE `patients` DISABLE KEYS */;
INSERT INTO `patients` VALUES (1,'Алексей','Смирнов','Сергеевич','3026','904014','1970-09-28','Ж','г. Красноярск, ул. Ленина, д. 91','+7-9478537457','patient1@mail.ru','ООО Сибур','POL-00000001','АльфаСтрахование-ОМС','2030-09-28','MC-000001','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(2,'Алексей','Лебедев','Андреевич','4300','999346','1964-09-28','М','г. Красноярск, ул. Ленина, д. 56','+7-9163028109','patient2@mail.ru','ООО Ромашка','POL-00000002','Согаз-Мед','2031-09-28','MC-000002','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(3,'Егор','Козлов','Сергеевич','0282','535554','1971-09-28','Ж','г. Красноярск, ул. Ленина, д. 2','+7-9978785733','patient3@mail.ru','МБОУ СОШ №1','POL-00000003','Ингосстрах-М','2028-09-28','MC-000003','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(4,'Владимир','Петров','Иванович','5627','225042','1980-09-28','М','г. Красноярск, ул. Ленина, д. 24','+7-9628365121','patient4@mail.ru','ИП Иванов','POL-00000004','Ингосстрах-М','2029-09-28','MC-000004','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(5,'Иван','Смирнов','Николаевич','2774','664272','1977-09-28','Ж','г. Красноярск, ул. Ленина, д. 80','+7-9618624599','patient5@mail.ru','ООО Сибур','POL-00000005','АльфаСтрахование-ОМС','2028-09-28','MC-000005','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(6,'Иван','Петров','Сергеевич','9704','441908','1989-09-28','Ж','г. Красноярск, ул. Ленина, д. 93','+7-9147193110','patient6@mail.ru','МБОУ СОШ №1','POL-00000006','Согаз-Мед','2030-09-28','MC-000006','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(7,'Алексей','Кузнецов','Андреевич','6548','123804','1967-09-28','М','г. Красноярск, ул. Ленина, д. 54','+7-9981464137','patient7@mail.ru','АО Красмаш','POL-00000007','Ингосстрах-М','2031-09-28','MC-000007','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(8,'Андрей','Лебедев','Иванович','1154','415768','1963-09-28','Ж','г. Красноярск, ул. Ленина, д. 88','+7-9135079131','patient8@mail.ru','ООО Ромашка','POL-00000008','АльфаСтрахование-ОМС','2027-09-28','MC-000008','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(9,'Петр','Новиков','Иванович','6881','162562','1962-09-28','Ж','г. Красноярск, ул. Ленина, д. 2','+7-9339661090','patient9@mail.ru','ООО Сибур','POL-00000009','Согаз-Мед','2031-09-28','MC-000009','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(10,'Михаил','Лебедев','Андреевич','8088','153676','1986-09-28','Ж','г. Красноярск, ул. Ленина, д. 22','+7-9322463701','patient10@mail.ru','МБОУ СОШ №1','POL-00000010','АльфаСтрахование-ОМС','2029-09-28','MC-000010','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(11,'Иван','Новиков','Петрович','8173','164143','1984-09-28','Ж','г. Красноярск, ул. Ленина, д. 65','+7-9165637777','patient11@mail.ru','МБОУ СОШ №1','POL-00000011','Согаз-Мед','2028-09-28','MC-000011','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(12,'Николай','Козлов','Иванович','3118','058793','1985-09-28','М','г. Красноярск, ул. Ленина, д. 1','+7-9162599928','patient12@mail.ru','МБОУ СОШ №1','POL-00000012','Ингосстрах-М','2028-09-28','MC-000012','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(13,'Иван','Сидоров','Николаевич','0917','608020','1961-09-28','М','г. Красноярск, ул. Ленина, д. 71','+7-9527095038','patient13@mail.ru','ИП Иванов','POL-00000013','Согаз-Мед','2029-09-28','MC-000013','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(14,'Петр','Петров','Сергеевич','8741','889444','1957-09-28','Ж','г. Красноярск, ул. Ленина, д. 80','+7-9630450623','patient14@mail.ru','ООО Сибур','POL-00000014','АльфаСтрахование-ОМС','2027-09-28','MC-000014','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(15,'Дмитрий','Лебедев','Сергеевич','3690','187253','1957-09-28','М','г. Красноярск, ул. Ленина, д. 44','+7-9401246973','patient15@mail.ru','ООО Сибур','POL-00000015','Ингосстрах-М','2030-09-28','MC-000015','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(16,'Петр','Кузнецов','Сергеевич','3478','221205','2003-09-28','М','г. Красноярск, ул. Ленина, д. 6','+7-9321867463','patient16@mail.ru','ИП Иванов','POL-00000016','Согаз-Мед','2027-09-28','MC-000016','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(17,'Алексей','Соколов','Сергеевич','5565','321474','1950-09-28','М','г. Красноярск, ул. Ленина, д. 81','+7-9849558085','patient17@mail.ru','МБОУ СОШ №1','POL-00000017','Ингосстрах-М','2030-09-28','MC-000017','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(18,'Владимир','Петров','Иванович','3022','090010','1974-09-28','Ж','г. Красноярск, ул. Ленина, д. 61','+7-9669773835','patient18@mail.ru','ИП Иванов','POL-00000018','АльфаСтрахование-ОМС','2031-09-28','MC-000018','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(19,'Дмитрий','Иванов','Андреевич','2006','066406','1963-09-28','Ж','г. Красноярск, ул. Ленина, д. 7','+7-9969240983','patient19@mail.ru','ООО Сибур','POL-00000019','Ингосстрах-М','2031-09-28','MC-000019','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(20,'Владимир','Петров','Иванович','7441','649144','2006-09-28','Ж','г. Красноярск, ул. Ленина, д. 55','+7-9390629361','patient20@mail.ru','АО Красмаш','POL-00000020','Ингосстрах-М','2031-09-28','MC-000020','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(21,'Сергей','Смирнов','Иванович','3143','229337','1994-09-28','Ж','г. Красноярск, ул. Ленина, д. 4','+7-9186694073','patient21@mail.ru','МБОУ СОШ №1','POL-00000021','Ингосстрах-М','2029-09-28','MC-000021','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(22,'Егор','Смирнов','Петрович','5668','669724','1968-09-28','Ж','г. Красноярск, ул. Ленина, д. 21','+7-9350783159','patient22@mail.ru','ООО Ромашка','POL-00000022','Ингосстрах-М','2029-09-28','MC-000022','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(23,'Николай','Иванов','Иванович','9102','953671','2004-09-28','Ж','г. Красноярск, ул. Ленина, д. 52','+7-9595549412','patient23@mail.ru','ИП Иванов','POL-00000023','Ингосстрах-М','2030-09-28','MC-000023','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(24,'Алексей','Новиков','Петрович','6652','336991','1965-09-28','Ж','г. Красноярск, ул. Ленина, д. 11','+7-9212496962','patient24@mail.ru','ООО Сибур','POL-00000024','Согаз-Мед','2028-09-28','MC-000024','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(25,'Михаил','Иванов','Николаевич','2107','477944','1961-09-28','Ж','г. Красноярск, ул. Ленина, д. 50','+7-9408409359','patient25@mail.ru','ИП Иванов','POL-00000025','Ингосстрах-М','2028-09-28','MC-000025','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(26,'Петр','Козлов','Сергеевич','1289','102080','1999-09-28','Ж','г. Красноярск, ул. Ленина, д. 19','+7-9001500696','patient26@mail.ru','ИП Иванов','POL-00000026','Согаз-Мед','2030-09-28','MC-000026','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(27,'Владимир','Соколов','Андреевич','3422','716306','1973-09-28','М','г. Красноярск, ул. Ленина, д. 46','+7-9417892024','patient27@mail.ru','ООО Сибур','POL-00000027','Согаз-Мед','2029-09-28','MC-000027','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(28,'Алексей','Петров','Николаевич','5626','847866','1973-09-28','Ж','г. Красноярск, ул. Ленина, д. 41','+7-9404909936','patient28@mail.ru','ООО Сибур','POL-00000028','АльфаСтрахование-ОМС','2029-09-28','MC-000028','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(29,'Андрей','Козлов','Николаевич','1581','883523','1950-09-28','Ж','г. Красноярск, ул. Ленина, д. 50','+7-9283373802','patient29@mail.ru','МБОУ СОШ №1','POL-00000029','АльфаСтрахование-ОМС','2028-09-28','MC-000029','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(30,'Андрей','Козлов','Сергеевич','7293','348913','1973-09-28','М','г. Красноярск, ул. Ленина, д. 1','+7-9832201121','patient30@mail.ru','ООО Ромашка','POL-00000030','Согаз-Мед','2029-09-28','MC-000030','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(31,'Алексей','Лебедев','Николаевич','3529','027026','2002-09-28','Ж','г. Красноярск, ул. Ленина, д. 27','+7-9440648682','patient31@mail.ru','ИП Иванов','POL-00000031','АльфаСтрахование-ОМС','2027-09-28','MC-000031','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(32,'Петр','Новиков','Сергеевич','3134','189280','2006-09-28','Ж','г. Красноярск, ул. Ленина, д. 30','+7-9080040629','patient32@mail.ru','ИП Иванов','POL-00000032','Ингосстрах-М','2028-09-28','MC-000032','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(33,'Владимир','Иванов','Андреевич','4347','967687','1974-09-28','М','г. Красноярск, ул. Ленина, д. 24','+7-9869135126','patient33@mail.ru','ООО Сибур','POL-00000033','Ингосстрах-М','2027-09-28','MC-000033','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(34,'Сергей','Смирнов','Иванович','1997','742535','2000-09-28','Ж','г. Красноярск, ул. Ленина, д. 36','+7-9752893271','patient34@mail.ru','ООО Сибур','POL-00000034','Согаз-Мед','2027-09-28','MC-000034','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(35,'Егор','Попов','Андреевич','2627','996009','1995-09-28','М','г. Красноярск, ул. Ленина, д. 28','+7-9479156025','patient35@mail.ru','ИП Иванов','POL-00000035','Ингосстрах-М','2027-09-28','MC-000035','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(36,'Егор','Смирнов','Андреевич','2665','088865','1968-09-28','М','г. Красноярск, ул. Ленина, д. 86','+7-9384342581','patient36@mail.ru','АО Красмаш','POL-00000036','АльфаСтрахование-ОМС','2028-09-28','MC-000036','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(37,'Петр','Лебедев','Сергеевич','4377','493851','1997-09-28','Ж','г. Красноярск, ул. Ленина, д. 3','+7-9213322843','patient37@mail.ru','ООО Ромашка','POL-00000037','Ингосстрах-М','2031-09-28','MC-000037','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(38,'Алексей','Козлов','Петрович','2415','170586','1999-09-28','Ж','г. Красноярск, ул. Ленина, д. 27','+7-9931378775','patient38@mail.ru','МБОУ СОШ №1','POL-00000038','Ингосстрах-М','2027-09-28','MC-000038','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(39,'Иван','Попов','Петрович','9367','798792','1995-09-28','М','г. Красноярск, ул. Ленина, д. 6','+7-9709280992','patient39@mail.ru','АО Красмаш','POL-00000039','АльфаСтрахование-ОМС','2030-09-28','MC-000039','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(40,'Андрей','Новиков','Иванович','8837','972781','1994-09-28','Ж','г. Красноярск, ул. Ленина, д. 9','+7-9975462716','patient40@mail.ru','ООО Сибур','POL-00000040','Согаз-Мед','2028-09-28','MC-000040','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(41,'Иван','Козлов','Николаевич','3987','087010','1992-09-28','М','г. Красноярск, ул. Ленина, д. 95','+7-9918908812','patient41@mail.ru','ООО Сибур','POL-00000041','Согаз-Мед','2027-09-28','MC-000041','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(42,'Дмитрий','Новиков','Петрович','8644','288490','1956-09-28','Ж','г. Красноярск, ул. Ленина, д. 36','+7-9613582822','patient42@mail.ru','ООО Ромашка','POL-00000042','Согаз-Мед','2027-09-28','MC-000042','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(43,'Егор','Попов','Николаевич','5702','324877','1952-09-28','М','г. Красноярск, ул. Ленина, д. 23','+7-9342784724','patient43@mail.ru','ООО Ромашка','POL-00000043','Согаз-Мед','2030-09-28','MC-000043','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(44,'Иван','Кузнецов','Андреевич','4407','096870','1997-09-28','М','г. Красноярск, ул. Ленина, д. 12','+7-9004926472','patient44@mail.ru','ООО Сибур','POL-00000044','Ингосстрах-М','2027-09-28','MC-000044','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(45,'Петр','Сидоров','Николаевич','8338','355718','1990-09-28','Ж','г. Красноярск, ул. Ленина, д. 76','+7-9805915124','patient45@mail.ru','ООО Сибур','POL-00000045','Ингосстрах-М','2027-09-28','MC-000045','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(46,'Иван','Смирнов','Петрович','8937','639132','1976-09-28','М','г. Красноярск, ул. Ленина, д. 73','+7-9656847197','patient46@mail.ru','ООО Ромашка','POL-00000046','Ингосстрах-М','2030-09-28','MC-000046','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(47,'Николай','Соколов','Петрович','1852','283441','1955-09-28','Ж','г. Красноярск, ул. Ленина, д. 71','+7-9134769323','patient47@mail.ru','ИП Иванов','POL-00000047','Ингосстрах-М','2029-09-28','MC-000047','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(48,'Михаил','Иванов','Николаевич','6999','575652','1960-09-28','Ж','г. Красноярск, ул. Ленина, д. 49','+7-9926435606','patient48@mail.ru','ООО Ромашка','POL-00000048','Согаз-Мед','2027-09-28','MC-000048','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(49,'Сергей','Смирнов','Петрович','8210','352958','1988-09-28','Ж','г. Красноярск, ул. Ленина, д. 34','+7-9343807375','patient49@mail.ru','ООО Сибур','POL-00000049','Ингосстрах-М','2028-09-28','MC-000049','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(50,'Андрей','Новиков','Николаевич','5009','943997','1993-09-28','Ж','г. Красноярск, ул. Ленина, д. 62','+7-9302940279','patient50@mail.ru','ООО Сибур','POL-00000050','Ингосстрах-М','2028-09-28','MC-000050','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(51,'Иван','Петров','Петрович','9689','077306','1978-09-28','Ж','г. Красноярск, ул. Ленина, д. 39','+7-9426920658','patient51@mail.ru','МБОУ СОШ №1','POL-00000051','Ингосстрах-М','2028-09-28','MC-000051','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(52,'Алексей','Попов','Петрович','4045','342687','1977-09-28','Ж','г. Красноярск, ул. Ленина, д. 86','+7-9845840313','patient52@mail.ru','ООО Сибур','POL-00000052','АльфаСтрахование-ОМС','2027-09-28','MC-000052','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(53,'Алексей','Кузнецов','Иванович','8713','355869','1997-09-28','М','г. Красноярск, ул. Ленина, д. 30','+7-9191413814','patient53@mail.ru','ООО Ромашка','POL-00000053','АльфаСтрахование-ОМС','2031-09-28','MC-000053','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(54,'Андрей','Кузнецов','Петрович','0149','357321','1962-09-28','М','г. Красноярск, ул. Ленина, д. 96','+7-9869316783','patient54@mail.ru','ИП Иванов','POL-00000054','АльфаСтрахование-ОМС','2029-09-28','MC-000054','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(55,'Андрей','Сидоров','Андреевич','3743','929301','1975-09-28','М','г. Красноярск, ул. Ленина, д. 58','+7-9383076691','patient55@mail.ru','ООО Ромашка','POL-00000055','АльфаСтрахование-ОМС','2029-09-28','MC-000055','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(56,'Иван','Новиков','Сергеевич','7624','263028','2005-09-28','Ж','г. Красноярск, ул. Ленина, д. 67','+7-9270067729','patient56@mail.ru','АО Красмаш','POL-00000056','АльфаСтрахование-ОМС','2031-09-28','MC-000056','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(57,'Иван','Кузнецов','Сергеевич','6056','444004','1982-09-28','М','г. Красноярск, ул. Ленина, д. 21','+7-9965172156','patient57@mail.ru','АО Красмаш','POL-00000057','Согаз-Мед','2028-09-28','MC-000057','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(58,'Дмитрий','Новиков','Петрович','5853','128023','1953-09-28','Ж','г. Красноярск, ул. Ленина, д. 53','+7-9523473516','patient58@mail.ru','ООО Ромашка','POL-00000058','Ингосстрах-М','2027-09-28','MC-000058','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(59,'Владимир','Козлов','Сергеевич','8656','940697','2000-09-28','М','г. Красноярск, ул. Ленина, д. 24','+7-9021409187','patient59@mail.ru','ИП Иванов','POL-00000059','Согаз-Мед','2031-09-28','MC-000059','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(60,'Алексей','Соколов','Сергеевич','6213','602964','1997-09-28','М','г. Красноярск, ул. Ленина, д. 27','+7-9499307525','patient60@mail.ru','ООО Сибур','POL-00000060','АльфаСтрахование-ОМС','2031-09-28','MC-000060','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(61,'Дмитрий','Иванов','Николаевич','4143','308117','1989-09-28','М','г. Красноярск, ул. Ленина, д. 93','+7-9923018157','patient61@mail.ru','МБОУ СОШ №1','POL-00000061','Ингосстрах-М','2031-09-28','MC-000061','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(62,'Михаил','Козлов','Иванович','9699','485320','1976-09-28','Ж','г. Красноярск, ул. Ленина, д. 9','+7-9025292452','patient62@mail.ru','МБОУ СОШ №1','POL-00000062','Ингосстрах-М','2027-09-28','MC-000062','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(63,'Андрей','Лебедев','Петрович','9201','809213','1989-09-28','М','г. Красноярск, ул. Ленина, д. 14','+7-9693974925','patient63@mail.ru','ООО Ромашка','POL-00000063','Согаз-Мед','2031-09-28','MC-000063','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(64,'Егор','Смирнов','Сергеевич','8572','896745','1952-09-28','М','г. Красноярск, ул. Ленина, д. 61','+7-9432537435','patient64@mail.ru','АО Красмаш','POL-00000064','Ингосстрах-М','2031-09-28','MC-000064','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(65,'Николай','Петров','Андреевич','2633','095561','1965-09-28','Ж','г. Красноярск, ул. Ленина, д. 70','+7-9026803855','patient65@mail.ru','ООО Ромашка','POL-00000065','Согаз-Мед','2029-09-28','MC-000065','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(66,'Андрей','Кузнецов','Иванович','2982','308423','1968-09-28','Ж','г. Красноярск, ул. Ленина, д. 62','+7-9122871702','patient66@mail.ru','ООО Сибур','POL-00000066','Ингосстрах-М','2028-09-28','MC-000066','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(67,'Михаил','Сидоров','Николаевич','8495','529831','2000-09-28','М','г. Красноярск, ул. Ленина, д. 26','+7-9547501720','patient67@mail.ru','МБОУ СОШ №1','POL-00000067','Согаз-Мед','2027-09-28','MC-000067','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(68,'Иван','Козлов','Николаевич','3684','881071','1989-09-28','М','г. Красноярск, ул. Ленина, д. 39','+7-9336257145','patient68@mail.ru','ИП Иванов','POL-00000068','АльфаСтрахование-ОМС','2031-09-28','MC-000068','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(69,'Дмитрий','Сидоров','Иванович','2387','180424','1995-09-28','Ж','г. Красноярск, ул. Ленина, д. 39','+7-9745672056','patient69@mail.ru','ИП Иванов','POL-00000069','АльфаСтрахование-ОМС','2030-09-28','MC-000069','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(70,'Владимир','Лебедев','Петрович','4309','095064','1996-09-28','М','г. Красноярск, ул. Ленина, д. 59','+7-9052083906','patient70@mail.ru','ИП Иванов','POL-00000070','Ингосстрах-М','2028-09-28','MC-000070','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(71,'Иван','Новиков','Андреевич','2189','191770','1988-09-28','М','г. Красноярск, ул. Ленина, д. 77','+7-9036514516','patient71@mail.ru','МБОУ СОШ №1','POL-00000071','Согаз-Мед','2030-09-28','MC-000071','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(72,'Николай','Кузнецов','Сергеевич','9823','163603','1954-09-28','М','г. Красноярск, ул. Ленина, д. 71','+7-9917344979','patient72@mail.ru','ИП Иванов','POL-00000072','Ингосстрах-М','2031-09-28','MC-000072','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(73,'Сергей','Попов','Андреевич','0099','840789','1996-09-28','Ж','г. Красноярск, ул. Ленина, д. 22','+7-9049931320','patient73@mail.ru','ИП Иванов','POL-00000073','АльфаСтрахование-ОМС','2028-09-28','MC-000073','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(74,'Алексей','Иванов','Андреевич','6508','888672','1977-09-28','М','г. Красноярск, ул. Ленина, д. 47','+7-9944845853','patient74@mail.ru','АО Красмаш','POL-00000074','АльфаСтрахование-ОМС','2028-09-28','MC-000074','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(75,'Дмитрий','Иванов','Андреевич','6230','892706','1971-09-28','Ж','г. Красноярск, ул. Ленина, д. 68','+7-9516415622','patient75@mail.ru','ИП Иванов','POL-00000075','Согаз-Мед','2028-09-28','MC-000075','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(76,'Алексей','Новиков','Николаевич','8524','422924','1973-09-28','М','г. Красноярск, ул. Ленина, д. 91','+7-9996201313','patient76@mail.ru','АО Красмаш','POL-00000076','Согаз-Мед','2030-09-28','MC-000076','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(77,'Алексей','Козлов','Петрович','2860','414251','1994-09-28','М','г. Красноярск, ул. Ленина, д. 48','+7-9895552060','patient77@mail.ru','ООО Ромашка','POL-00000077','Ингосстрах-М','2031-09-28','MC-000077','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(78,'Дмитрий','Сидоров','Николаевич','1060','622834','1959-09-28','Ж','г. Красноярск, ул. Ленина, д. 17','+7-9507443578','patient78@mail.ru','ООО Ромашка','POL-00000078','Ингосстрах-М','2027-09-28','MC-000078','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(79,'Михаил','Лебедев','Петрович','8887','248780','1972-09-28','Ж','г. Красноярск, ул. Ленина, д. 98','+7-9445737536','patient79@mail.ru','АО Красмаш','POL-00000079','Согаз-Мед','2027-09-28','MC-000079','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(80,'Дмитрий','Сидоров','Андреевич','6067','068584','1975-09-28','Ж','г. Красноярск, ул. Ленина, д. 47','+7-9104183645','patient80@mail.ru','ООО Ромашка','POL-00000080','Согаз-Мед','2028-09-28','MC-000080','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(81,'Алексей','Попов','Николаевич','1928','119137','2005-09-28','М','г. Красноярск, ул. Ленина, д. 60','+7-9767135838','patient81@mail.ru','ООО Ромашка','POL-00000081','Согаз-Мед','2031-09-28','MC-000081','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(82,'Николай','Козлов','Сергеевич','6370','798843','2002-09-28','Ж','г. Красноярск, ул. Ленина, д. 85','+7-9159518405','patient82@mail.ru','АО Красмаш','POL-00000082','АльфаСтрахование-ОМС','2029-09-28','MC-000082','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(83,'Дмитрий','Кузнецов','Сергеевич','9588','553048','1953-09-28','М','г. Красноярск, ул. Ленина, д. 25','+7-9889857839','patient83@mail.ru','ООО Сибур','POL-00000083','АльфаСтрахование-ОМС','2028-09-28','MC-000083','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(84,'Андрей','Сидоров','Николаевич','4508','684746','2002-09-28','Ж','г. Красноярск, ул. Ленина, д. 30','+7-9555054138','patient84@mail.ru','МБОУ СОШ №1','POL-00000084','АльфаСтрахование-ОМС','2029-09-28','MC-000084','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54'),(85,'Петр','Новиков','Петрович','2878','803299','1997-09-28','Ж','г. Красноярск, ул. Ленина, д. 32','+7-9492295245','patient85@mail.ru','ИП Иванов','POL-00000085','Согаз-Мед','2028-09-28','MC-000085','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(86,'Петр','Смирнов','Николаевич','0824','692083','1994-09-28','М','г. Красноярск, ул. Ленина, д. 31','+7-9554907211','patient86@mail.ru','МБОУ СОШ №1','POL-00000086','Ингосстрах-М','2030-09-28','MC-000086','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(87,'Дмитрий','Смирнов','Андреевич','1655','805307','1975-09-28','Ж','г. Красноярск, ул. Ленина, д. 58','+7-9175867797','patient87@mail.ru','ООО Ромашка','POL-00000087','Согаз-Мед','2030-09-28','MC-000087','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(88,'Петр','Попов','Петрович','5509','040540','1974-09-28','М','г. Красноярск, ул. Ленина, д. 49','+7-9545272675','patient88@mail.ru','АО Красмаш','POL-00000088','АльфаСтрахование-ОМС','2030-09-28','MC-000088','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(89,'Сергей','Соколов','Петрович','2872','633239','1988-09-28','М','г. Красноярск, ул. Ленина, д. 20','+7-9130068173','patient89@mail.ru','ООО Ромашка','POL-00000089','АльфаСтрахование-ОМС','2027-09-28','MC-000089','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(90,'Иван','Сидоров','Петрович','5424','872642','1962-09-28','Ж','г. Красноярск, ул. Ленина, д. 10','+7-9289023654','patient90@mail.ru','ООО Ромашка','POL-00000090','АльфаСтрахование-ОМС','2028-09-28','MC-000090','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(91,'Дмитрий','Иванов','Андреевич','2897','441799','1986-09-28','Ж','г. Красноярск, ул. Ленина, д. 85','+7-9120245731','patient91@mail.ru','ООО Ромашка','POL-00000091','АльфаСтрахование-ОМС','2029-09-28','MC-000091','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(92,'Егор','Смирнов','Иванович','5203','165242','1991-09-28','М','г. Красноярск, ул. Ленина, д. 36','+7-9275877351','patient92@mail.ru','АО Красмаш','POL-00000092','АльфаСтрахование-ОМС','2031-09-28','MC-000092','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(93,'Дмитрий','Соколов','Андреевич','4265','178265','1970-09-28','М','г. Красноярск, ул. Ленина, д. 78','+7-9327881155','patient93@mail.ru','АО Красмаш','POL-00000093','Ингосстрах-М','2030-09-28','MC-000093','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(94,'Егор','Лебедев','Андреевич','5696','600765','1989-09-28','М','г. Красноярск, ул. Ленина, д. 48','+7-9359509869','patient94@mail.ru','АО Красмаш','POL-00000094','АльфаСтрахование-ОМС','2031-09-28','MC-000094','2026-09-28',NULL,'Бронхит','2026-09-28 11:39:54'),(95,'Владимир','Сидоров','Николаевич','7613','018687','1958-09-28','М','г. Красноярск, ул. Ленина, д. 53','+7-9646737771','patient95@mail.ru','ООО Сибур','POL-00000095','Ингосстрах-М','2031-09-28','MC-000095','2026-09-28',NULL,'Гипертония','2026-09-28 11:39:54'),(96,'Егор','Соколов','Сергеевич','4614','863636','1950-09-28','Ж','г. Красноярск, ул. Ленина, д. 59','+7-9702787922','patient96@mail.ru','ООО Сибур','POL-00000096','Ингосстрах-М','2027-09-28','MC-000096','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(97,'Дмитрий','Иванов','Николаевич','9234','184355','1997-09-28','Ж','г. Красноярск, ул. Ленина, д. 56','+7-9181833273','patient97@mail.ru','АО Красмаш','POL-00000097','Ингосстрах-М','2029-09-28','MC-000097','2026-09-28',NULL,'Гастрит','2026-09-28 11:39:54'),(98,'Михаил','Попов','Сергеевич','8093','544771','1989-09-28','М','г. Красноярск, ул. Ленина, д. 33','+7-9117031628','patient98@mail.ru','ИП Иванов','POL-00000098','Ингосстрах-М','2028-09-28','MC-000098','2026-09-28',NULL,'ОРВИ','2026-09-28 11:39:54'),(99,'Егор','Попов','Иванович','7881','632899','1959-09-28','Ж','г. Красноярск, ул. Ленина, д. 11','+7-9222001264','patient99@mail.ru','ООО Сибур','POL-00000099','Согаз-Мед','2027-09-28','MC-000099','2026-09-28',NULL,'Ангина','2026-09-28 11:39:54');
/*!40000 ALTER TABLE `patients` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `schedule`
--

DROP TABLE IF EXISTS `schedule`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `schedule` (
  `id` int NOT NULL AUTO_INCREMENT,
  `doctor_id` int NOT NULL,
  `patient_id` int DEFAULT NULL,
  `visit_date` date NOT NULL,
  `visit_time` time NOT NULL,
  `status` varchar(50) DEFAULT 'Свободно',
  `is_approved` tinyint(1) DEFAULT '0',
  `notes` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `doctor_id` (`doctor_id`),
  KEY `patient_id` (`patient_id`),
  CONSTRAINT `schedule_ibfk_1` FOREIGN KEY (`doctor_id`) REFERENCES `doctors` (`id`),
  CONSTRAINT `schedule_ibfk_2` FOREIGN KEY (`patient_id`) REFERENCES `patients` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `schedule`
--

LOCK TABLES `schedule` WRITE;
/*!40000 ALTER TABLE `schedule` DISABLE KEYS */;
INSERT INTO `schedule` VALUES (1,1,NULL,'2026-09-30','09:00:00','Свободно',0,NULL),(2,1,NULL,'2026-09-30','10:00:00','Свободно',0,NULL),(3,1,NULL,'2026-10-01','11:00:00','Свободно',0,NULL),(4,1,NULL,'2026-10-01','14:00:00','Свободно',0,NULL),(5,2,NULL,'2026-09-30','09:30:00','Свободно',0,NULL),(6,2,NULL,'2026-09-30','10:30:00','Свободно',0,NULL),(7,2,NULL,'2026-10-02','15:00:00','Свободно',0,NULL),(8,2,NULL,'2026-10-02','16:00:00','Свободно',0,NULL),(9,3,NULL,'2026-09-30','08:00:00','Свободно',0,NULL),(10,3,NULL,'2026-10-01','12:00:00','Свободно',0,NULL),(11,3,NULL,'2026-10-02','13:00:00','Свободно',0,NULL),(12,3,NULL,'2026-10-03','09:00:00','Свободно',0,NULL),(13,4,NULL,'2026-09-30','11:30:00','Свободно',0,NULL),(14,4,NULL,'2026-10-01','14:30:00','Свободно',0,NULL),(15,4,NULL,'2026-10-02','10:00:00','Свободно',0,NULL),(16,4,NULL,'2026-10-03','15:30:00','Свободно',0,NULL),(17,5,NULL,'2026-09-30','13:00:00','Свободно',0,NULL),(18,5,NULL,'2026-10-01','09:30:00','Свободно',0,NULL),(19,5,NULL,'2026-10-02','14:00:00','Свободно',0,NULL),(20,5,NULL,'2026-10-03','16:30:00','Свободно',0,NULL);
/*!40000 ALTER TABLE `schedule` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `schedule_history`
--

DROP TABLE IF EXISTS `schedule_history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `schedule_history` (
  `id` int NOT NULL AUTO_INCREMENT,
  `schedule_id` int NOT NULL,
  `changed_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `changed_by` varchar(100) DEFAULT NULL,
  `action` varchar(100) DEFAULT NULL,
  `old_value` varchar(255) DEFAULT NULL,
  `new_value` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `schedule_history`
--

LOCK TABLES `schedule_history` WRITE;
/*!40000 ALTER TABLE `schedule_history` DISABLE KEYS */;
/*!40000 ALTER TABLE `schedule_history` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'clinic_db'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-09-29 17:54:36
